In [2]:
import pandas as pd

# Data Preview and pre-Processing

Credits CSV

In [3]:
cast_df = pd.read_csv('./Data/credits.csv')
cast_df.head()

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862
1,"[{'cast_id': 1, 'character': 'Alan Parrish', '...","[{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...",8844
2,"[{'cast_id': 2, 'character': 'Max Goldman', 'c...","[{'credit_id': '52fe466a9251416c75077a89', 'de...",15602
3,"[{'cast_id': 1, 'character': ""Savannah 'Vannah...","[{'credit_id': '52fe44779251416c91011acb', 'de...",31357
4,"[{'cast_id': 1, 'character': 'George Banks', '...","[{'credit_id': '52fe44959251416c75039ed7', 'de...",11862

In [3]:
x = (cast_df['cast'][0])
y = ast.literal_eval(x)
for k in y[0]:   
    print(k, y[0][k])

cast_id 14
character Woody (voice)
credit_id 52fe4284c3a36847f8024f95
gender 2
id 31
name Tom Hanks
order 0
profile_path /pQFoyx7rp09CJTAb932F2g8Nlho.jpg

### get the Actor Data for each movie

In [4]:
actors = [("movie_id", "actor_id", "name", "order", "gender")]
cast = cast_df['cast']
ids = cast_df['id']
N = cast.shape[0]

for i in range(N):
    info_str = cast[i]
    id = ids[i]
    info_dicts = ast.literal_eval(info_str)
    for entry in info_dicts:
        actors.append((id, entry['id'], entry['name'], entry['order'], entry['gender']))

In [5]:
actors_df = pd.DataFrame(actors[1:], columns=actors[0])
actors_df.head()

# gender 0 for others

   movie_id  actor_id           name  order  gender
0       862        31      Tom Hanks      0       2
1       862     12898      Tim Allen      1       2
2       862      7167    Don Rickles      2       2
3       862     12899     Jim Varney      3       2
4       862     12900  Wallace Shawn      4       2

#### get the Director Data for each movie

In [6]:
directors = [("movie_id", "name")]
crew = cast_df['crew']
ids = cast_df['id']
N = crew.shape[0]

for i in range(N):
    info_str = crew[i]
    id = ids[i]
    info_dicts = ast.literal_eval(info_str)
    for entry in info_dicts:
        if entry['job'] == 'Director':
            directors.append((id, entry['name']))

In [7]:
directors_df = pd.DataFrame(directors[1:], columns=directors[0])
directors_df.head()

   movie_id             name
0       862    John Lasseter
1      8844     Joe Johnston
2     15602    Howard Deutch
3     31357  Forest Whitaker
4     11862    Charles Shyer

Comparing number of movies to number of diectors it is apparent that some movies have multiple directors.  
Comparing number of actors per movie comes out to be average of 12 actors per movie.

In [8]:
print(len(directors), N)
print(len(actors)/N)

49049 45476
12.368612015128859

In [9]:
actors_df.to_csv('./processed/actors.csv', index=False)
directors_df.to_csv('./processed/directors.csv', index=False)

Keywords CSV

In [10]:
kw_df = pd.read_csv('./Data/keywords.csv')
kw_df.head()

      id                                           keywords
0    862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1   8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2  15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3  31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4  11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...

In [11]:
x = kw_df['keywords'][1]
y = ast.literal_eval(x)
N = kw_df.shape[0]
keywords = [("movie_id", "keyword_id", "keyword")]
for i in range(N):
    id = kw_df['id'][i]
    info_str = kw_df['keywords'][i]
    info_dicts = ast.literal_eval(info_str)
    for entry in info_dicts:
        keywords.append((id, entry['id'], entry['name']))

In [12]:
kw_df = pd.DataFrame(keywords[1:], columns=keywords[0])
kw_df.head()

   movie_id  keyword_id     keyword
0       862         931    jealousy
1       862        4290         toy
2       862        5202         boy
3       862        6054  friendship
4       862        9713     friends

In [13]:
kw_df.to_csv('./processed/keywords.csv', index=False)

Movies_metadata CSV

In [4]:
m_df = pd.read_csv('./Data/movies_metadata.csv')
m_df.status.unique()

C:\Users\hp\AppData\Local\Temp\ipykernel_14472\3073352996.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  m_df = pd.read_csv('./Data/movies_metadata.csv')

array(['Released', nan, 'Rumored', 'Post Production', 'In Production',
       'Planned', 'Canceled'], dtype=object)

In [15]:
#drop rows with status != 'Released'
m_df = m_df[m_df.status == 'Released'].reset_index(drop= True)

In [16]:
# summary of m_df
m_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45014 entries, 0 to 45013
Data columns (total 24 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  45014 non-null  object
 1   belongs_to_collection  4466 non-null   object
 2   budget                 45014 non-null  object
 3   genres                 45014 non-null  object
 4   homepage               7706 non-null   object
 5   id                     45014 non-null  object
 6   imdb_id                44999 non-null  object
 7   original_language      45004 non-null  object
 8   original_title         45014 non-null  object
 9   overview               44094 non-null  object
 10  popularity             45014 non-null  object
 11  poster_path            44641 non-null  object
 12  production_companies   45014 non-null  object
 13  production_countries   45014 non-null  object
 14  release_date           44936 non-null  object
 15  revenue                45014 non-null  float64
 16  runtime                44763 non-null  float64
 17  spoken_languages       45014 non-null  object
 18  status                 45014 non-null  object
 19  tagline                20300 non-null  object
 20  title                  45014 non-null  object
 21  video                  45014 non-null  object
 22  vote_average           45014 non-null  float64
 23  vote_count             45014 non-null  float64
dtypes: float64(4), object(20)
memory usage: 8.2+ MB

In [17]:
m_df.id = m_df.id.astype(int)

Extracting genres

In [18]:
genres = [("movie_id", "genre_id", "genre")]
N = m_df.shape[0]

for i in range(N):
    id = m_df['id'][i]
    if not id: 
        continue
    info_str = m_df['genres'][i]
    info_dicts = ast.literal_eval(info_str)

    for entry in info_dicts:
        genres.append((id, entry['id'], entry['name']))

In [19]:
genres_df = pd.DataFrame(genres[1:], columns=genres[0])
genres_df.head()

   movie_id  genre_id      genre
0       862        16  Animation
1       862        35     Comedy
2       862     10751     Family
3      8844        12  Adventure
4      8844        14    Fantasy

In [20]:
genres_df.to_csv('./processed/genres.csv', index=False)

In [21]:
m_df.status.unique()

array(['Released'], dtype=object)

Now having the rows of interest let's determine the columns (attributes) of interest for this analysis

In [22]:
attributes = ['movie_id', 'title', 'popularity', 'budget', 'revenue', 'vote_average', 'vote_count']
m_df.columns

Index(['adult', 'belongs_to_collection', 'budget', 'genres', 'homepage', 'id',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count'],
      dtype='object')

In [23]:
attributes = ['movie_id', 'title', 'release_date', 'popularity', 'budget', 'revenue', 'vote_average', 'vote_count']
meta_data = [attributes]

# Extract the required columns from the original DataFrame
meta_data.extend(m_df[['id', 'original_title', 'release_date', 'popularity', 'budget', 'revenue', 'vote_average', 'vote_count']].values.tolist())

In [24]:
meta_df = pd.DataFrame(meta_data[1:], columns=meta_data[0])
meta_df.head()

,movie_id,title,release_date,popularity,budget,revenue,vote_average,vote_count
0,862,Toy Story,1995-10-30,21.946943,30000000,373554033.0,7.7,5415.0
1,8844,Jumanji,1995-12-15,17.015539,65000000,262797249.0,6.9,2413.0
2,15602,Grumpier Old Men,1995-12-22,11.7129,0,0.0,6.5,92.0
3,31357,Waiting to Exhale,1995-12-22,3.859495,16000000,81452156.0,6.1,34.0
4,11862,Father of the Bride Part II,1995-02-10,8.387519,0,76578911.0,5.7,173.0

In [28]:
meta_df.to_csv('./processed/metadata.csv', index=False)